nemanjadjekic/stm32f446xx_drivers/Drivers/src/stm32f446xx_i2c_driver.c
	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;

	if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE)
	{
		I2C_ManageAcking(pI2CHandle->pI2Cx,ENABLE);
	}

}


/*****************************************************************
 * @fn			- I2C_CloseSendData
 *
 * @brief		- Closing I2C communication when data is
 * 			  sent
 *
 * @param[in]		- Pointer to I2C Handle structure
 *
 * @return		- None
 *
 * @Note		- Disabling all interrupts
 *
 *****************************************************************/
void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
	/* Disabling ITBUFEN Control Bit */
	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITBUFEN);

	/* Disabling ITEVFEN Control Bit */
	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITEVTEN);


	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pTxBuffer = NULL;
	pI2CHandle->TxLen = 0;
}


/*****************************************************************
 * @fn			- I2C_GenerateStopCondition
 *
 * @brief		- Generate stop condition for I2C
 *
 * @param[in]		- Base address of the I2C peripheral
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_STOP);
}


/*****************************************************************
 * @fn			- I2C_SlaveEnableDisableCallbackEvents
 *
 * @brief		- Generate stop condition for I2C
 *
 * @param[in]		- Base address of the I2C peripheral
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
	{
		pI2Cx->CR2 |= (1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITERREN);
	}
	else
	{
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITERREN);
	}
}


/*****************************************************************
 *               Helper functions implementation                 *
 *****************************************************************/
/*****************************************************************
 * @fn			- I2C_GenerateStartCondition
 *
 * @brief		- Generate start condition for I2C
 *
 * @param[in]		- Base address of the I2C peripheral
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_START);
}


/*****************************************************************
 * @fn			- I2C_ExecuteAddressPhaseWrite
 *
 * @brief		- Send the address of the slave with r/nm
 * 			  bit set to r/nw(0) (total 8 bits)
 *
 * @param[in]		- Base address of the I2C peripheral
 * @param[in]		- Slave address
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	SlaveAddr = SlaveAddr << 1;
	/* SlaveAddr is Slave address + r/nw bit=0 */
	SlaveAddr &= ~(1);
	pI2Cx->DR = SlaveAddr;
}


/*****************************************************************
 * @fn			- I2C_ExecuteAddressPhaseRead
 *
 * @brief		- Send the address of the slave with r/nm
 * 			  bit set to r/nw(1) (total 8 bits)
 *
 * @param[in]		- Base address of the I2C peripheral
 * @param[in]		- Slave address
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	SlaveAddr = SlaveAddr << 1;
	/* SlaveAddr is Slave address + r/nw bit=1 */
	SlaveAddr |= 1;
	pI2Cx->DR = SlaveAddr;
}


/*****************************************************************
 * @fn			- I2C_ClearAddrFlag
 *
 * @brief		- Clear address flag
 *
 * @param[in]		- Base address of the I2C peripheral
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_ClearAddrFlag(I2C_Handle_t *pI2CHandle)
{
	uint32_t dummy_read;

	/* Checking for device mode */
	if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL))
	{
		/* Device is in master mode */
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
		{
			if(pI2CHandle->RxSize == 1)
			{
				/* Disabling ACK */
				I2C_ManageAcking(pI2CHandle->pI2Cx, DISABLE);

				/* Clearing ADDR flag, reading SR1 and SR2 */
				dummy_read = pI2CHandle->pI2Cx->SR1;
				dummy_read = pI2CHandle->pI2Cx->SR2;
				(void)dummy_read;
			}
		}
		else
		{
			/* Clearing ADDR flag, reading SR1 and SR2 */
			dummy_read = pI2CHandle->pI2Cx->SR1;
			dummy_read = pI2CHandle->pI2Cx->SR2;
			(void)dummy_read;
		}
	}
	else
	{
		/* Device is in slave mode */
		/* Clearing ADDR flag, reading SR1 and SR2 */
		dummy_read = pI2CHandle->pI2Cx->SR1;
		dummy_read = pI2CHandle->pI2Cx->SR2;
		(void)dummy_read;
	}
}


/*****************************************************************
 * @fn			- I2C_MasterHandleTXEInterrupt
 *
 * @brief		- Interrupt handling master TXE mode
 *
 * @param[in]		- Pointer to I2C Handle structure
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle)
{
	/* TXE flag is set */
	if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
	{
		if(pI2CHandle->TxLen > 0)
		{
			/* Loading data into DR */
			pI2CHandle->pI2Cx->DR = *(pI2CHandle->pTxBuffer);

			/* Decrement Tx Length */
			pI2CHandle->TxLen--;

			/* Increment Tx buffer address */
			pI2CHandle->pTxBuffer++;

		}
	}
	/* DBG->Check comments */
}


/*****************************************************************
 * @fn			- I2C_MasterHandleRXNEInterrupts
 *
 * @brief		- Interrupt handling master RXNE mode
 *
 * @param[in]		- Pointer to I2C Handle structure
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle)
{
	if(pI2CHandle->RxSize == 1)
	{
		*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
		pI2CHandle->RxLen--;
	}

	if(pI2CHandle->RxSize > 1)
	{
		if(pI2CHandle->RxLen == 2)
		{
			/* Clearing ACK bit */
			I2C_ManageAcking(pI2CHandle->pI2Cx, DISABLE);
		}

		/* Reading DR */
		*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
		pI2CHandle->pRxBuffer++;
		pI2CHandle->RxLen--;
	}

	if(pI2CHandle->RxLen == 0)
	{
		/* Closing I2C data reception and notifying application */

		/* Generating stop condition */
		if(pI2CHandle->Sr == I2C_DISABLE_SR)
		{
			I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
		}

		/* Closing I2C RX */
		I2C_CloseReceiveData(pI2CHandle);

		/* Notify application about transmission complete */
		I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_RX_CMPLT);
	}
}


/*****************************************************************
 * @fn			- I2C_ApplicationEventCallback
 *
 * @brief		- Application event callback function
 *
 * @param[in]		- Handle structure
 * @param[in]		- Application event
 *
 * @return		- None
 *
 * @Note		- None
 *
 *****************************************************************/
__weak void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEvent)
{
	/* This is a week implementation. The application may override this function. */
}
